clc,clear
tic
%%

%La1=10000;%阻尼系数
%Lab=10000;%阻尼系数的比例系数

%%
% Max=zeros(1,23);
% Min=zeros(1,23);
tmp2=zeros(1,501);
tmp1=0:0.2:100;
cnt=1;
for n=0:0.2:1

    for Lab=500:10000:100000

        cal_coe(Lab,n);
        [t,x]=ode45(@func,[0:0.2:255],[0 0 0.2019575 0]);
        tmp2(cnt,:)=x(751:1251,2)-x(751:1251,4);
        fitresult=createFit(tmp1,tmp2(cnt,:))
        cnt=cnt+1
    end
end
%     [Maxt,Mint]=findA(x(:,1),Max,Min);
%     Max(end+1,:)=Maxt(end,:);
%     Min(end+1,:)=Mint(end,:);






toc
%%
load ALabn.mat

Lab=ALabn(:,1);
A=ALabn(:,2);

plot(Lab(1:10),A(1:10),'Marker','*','color','r')
hold on
plot(Lab(11:20),A(11:20),'Marker','*','color','k')
plot(Lab(21:30),A(21:30),'Marker','*','color','r')
plot(Lab(31:40),A(31:40),'Marker','*','color','k')
plot(Lab(41:50),A(41:50),'Marker','*','color','r')
plot(Lab(51:60),A(51:60),'Marker','*','color','k')
%%
w=2.2143;
T=2*pi/w;
d=0.001;
t=0:d:T;
x=0:1:100000;
%%
n=0;
% xt=Lab(1:10);
for i=1:10
    P1(i)=trapz(Lab(i).*(abs(A(i).*sin(w.*t))).^(n+2)).*d/T;
end

P1 = -1.471e-22.*x.^5 + 2.388e-17.*x.^4 + 3.713e-13.*x.^3-2.597e-07.*x.^2 + 0.01443.*x - 1.427;
% P1 = 0.5.*x.*(4.358e-26.*x.^5 - 1.358e-20.*x.^4 + 1.593e-15.*x.^3 -7.766e-11.*x.^2 + 4.529e-08.*x + 0.1578).^(2+n);
index=find(P1==max(P1));

disp('最大大输出功率')
max(P1)
disp('最优阻尼系数')
x(index)
plot(x,P1);
hold on
plot(x(index),P1(index),'*')
%%
n=0.2;
% xt=Lab(11:20);
for i=11:20
    P2(i-10)=trapz(Lab(i).*(abs(A(i).*sin(w.*t))).^(n+2)).*d/T;
end
P2 = - 1.233e-22.*x.^5 + 2.932e-17.*x.^4 - 1.923e-12.*x.^3 -4.405e-08.*x.^2 + 0.008661.*x - 0.3197;
% P2 = 0.5.*x.*(5.462e-27.*x.^5 - 2.673e-21.*x.^4 + 4.613e-16.*x.^3 -3.228e-11.*x.^2 + 3.799e-09.*x + 0.1578).^(2+n);
index=find(P2==max(P2));

disp('最大大输出功率')
max(P2)
disp('最优阻尼系数')
x(index)
plot(x,P2);
hold on
plot(x(index),P2(index),'*')
%%
n=0.4;
% xt=Lab(21:30);
for i=21:30
    P3(i-20)=trapz(Lab(i).*(abs(A(i).*sin(w.*t))).^(n+2)).*d/T;
end
P3 = - 4.57e-23.*x.^5 + 1.297e-17.*x.^4 - 1.162e-12.*x.^3 +3.093e-11.*x.^2 + 0.005524.*x - 0.0304;
% P3 = 0.5.*x.*(-5e-27.*x.^5 + 8.301e-22.*x.^4 + 2.03e-17.*x.^3 - 9.633e-12.*x.^2 -5.421e-08.*x + 0.1578).^(2+n);
index=find(P3==max(P3));

disp('最大大输出功率')
max(P3)
disp('最优阻尼系数')
x(index)
plot(x,P3);
hold on
plot(x(index),P3(index),'*')
%%
n=0.6;
% xt=Lab(31:40);
for i=31:40
    P4(i-30)=trapz(Lab(i).*(abs(A(i).*sin(w.*t))).^(n+2)).*d/T;
end
P4 = - 9.836e-24.*x.^5 + 3.465e-18.*x.^4 - 4.141e-13.*x.^3 +1.924e-09.*x.^2 + 0.003666*x + 0.007211;
% P4 = 0.5.*x.*(-3.462e-27.*x.^5 + 7.773e-22.*x.^4 - 3.948e-17.*x.^3 -2.83e-12.*x.^2 - 4.098e-08.*x + 0.1576).^(2+n);
index=find(P4==max(P4));

disp('最大大输出功率')
max(P4)
disp('最优阻尼系数')
x(index)
plot(x,P4);
hold on
plot(x(index),P4(index),'*')
%%
n=0.8;
% xt=Lab(41:50);
for i=41:50
    P5(i-40)=trapz(Lab(i).*(abs(A(i).*sin(w.*t))).^(n+2)).*d/T;
end
P5 = - 1.175e-23.*x.^5 + 2.876e-18.*x.^4 - 2.742e-13.*x.^3 +4.47e-09.*x.^2 + 0.002435.*x + 0.01504;
% P5 = 0.5.*x.*(-6.923e-27.*x.^5 + 1.525e-21.*x.^4 - 1.079e-16.*x.^3 +1.231e-12.*x.^2 - 3.992e-08.*x + 0.1576).^(2+n);
index=find(P5==max(P5));

disp('最大大输出功率')
max(P5)
disp('最优阻尼系数')
x(index)
plot(x,P5);
hold on
plot(x(index),P5(index),'*')
%%
n=1;
xt=Lab(51:60);
for i=51:60
    P6(i-50)=trapz(Lab(i).*(abs(A(i).*sin(w.*t))).^(n+2)).*d/T;
end
P6 = 4.34e-25.*x.^5 + 1.098e-19.*x.^4 - 4.353e-14.*x.^3 +7.217e-10.*x.^2 + 0.001645.*x + 0.02968;
% P6 = 0.5.*x.*(-6.41e-28.*x.^5 + 2.813e-22.*x.^4 - 3.59e-17.*x.^3 +1.146e-12.*x.^2 - 4.922e-08.*x + 0.1578).^(2+n);
index=find(P6==max(P6));

disp('最大大输出功率')
max(P6)
disp('最优阻尼系数')
x(index)
plot(x,P6);
hold on
plot(x(index),P6(index),'*')
%%

% x=0:1:100000;
% P = 0.5.*x.*(5.078.*10.^-26.*x.^5-1.634.*10.^-20.*x.^4+1.965.*10.^-15.*x.^3-9.798.*10.^-11.*x.^2 + 1.916.*10.^-7.*x + 0.1869).^2;
% plot(x,P);

% DP=diff(P)
% DP=simplify(DP)
% solve(DP,x)
% DP=(1.2893.*10.^-51.*p).*(31811.9+p).^2.*(1.59395.*10.^10-243954.*p+p)
% (x*(5529452349518481875*x^5 - 1779268440156203253760000*x^4 + 213969552319886125244088320000*x^3 - 10669077219492336970260482621440000*x^2 + 20863392480656578542810262122004480000*x + 20351607800807487622817508521279193190760448)^2)/23714219875802356822747337729779283528349692859523187515280913204820608950258892800000000
