function [a11,a12,a13,a14,a15,a16,a17,c11,c12,c13,c14,c15,a21,a22,a23,a24,a25,c21,c22,c23] = cal_coe()

mf = 4866  ;% 浮子质量
rf = 1     ;% 浮子底半径
hfz= 3     ;% 浮子圆柱部分高度
hV = 0.8   ;% 浮子圆锥部分高度
mz = 2433  ;% 振子质量
rz = 0.5   ;% 振子半径 (m)
hz = 0.5   ;% 振子高度 (m)
p  = 1025  ;% 海水的密度 (kg/m3)
g  = 9.8   ;% 重力加速度 (m/s2)
kg = 80000 ;% 弹簧刚度 (N/m)
l0 = 0.5   ;% 弹簧原长 (m)
km = 250000;% 扭转弹簧刚度 (N·m)
j  = 8890.7;% 静水恢复力矩系数 (N·m)

f    = 1.7152     ;% 入射波浪频率 (s-1)
mad  = 1028.876   ;% 垂荡附加质量 (kg)
Jad  = 7001.914   ;% 纵摇附加转动惯量 (kg·m2)
L_r  = 683.4558   ;% 垂荡兴波阻尼系数 (N·s/m)
L_z  = 654.3383   ;% 纵摇兴波阻尼系数 (N·m·s)
A    = 3640       ;% 垂荡激励力振幅 (N)
M    = 1690       ;% 纵摇激励力矩振幅 (N·m)

La1    = 10000    ;% 直线阻尼器系数
La2    = 1000     ;% 旋转阻尼器系数
% Lab    = 10000    % 阻尼系数的比例系数

J_f_C1    = 5268.0135    ;% 浮子相对于C1的转动惯量
J_fad_C1  = J_f_C1+Jad   ;% 浮子加纵摇附加转动惯量对C1
L_A_C1    = 49/45        ;% A与C1距离

J_f_A    = J_fad_C1+mf*L_A_C1*L_A_C1  ;% 浮子附加后对A点的转动惯量

J_Z_C2    = mz*(l0*l0/12+rz*rz/4) ;%202.75

% J_Z_A     = J_Z_C2+mz;


% 问题三 浮子z方向方程参数
m1    = mf+mad;

a11   = -La1/m1;
a12   = -L_r/m1;
a13   = -(kg+p*g*pi)/m1;
a14   = kg/m1;
a15   = -0.75*kg/m1;
a16   = A/m1;
a17   = mz*g/m1;



% 问题三 浮子alpha角的方程参数
c11   = -(La2+L_z)/J_f_A;
c12   = La2/J_f_A;
c13   = -(j+km)/J_f_A;
c14   = km/J_f_A;
c15   = M/J_f_A;



% 问题三 振子z方向方程参数
m2 = mz;

a21   = La1/m2;
a22   = kg/m2;
a23   = -kg/m2;
a24   = 0.75*kg/m2;
a25   = -g;


% 问题三 振子b角的方程参数
c21    = L_z;
c22    = km;
c23    = mz*g;



save coe.mat a11 a12 a13 a14 a15 a16 a17 c11 c12 c13 c14 c15 a21 a22 a23 a24 a25 c21 c22 c23
end